#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devsyukov/infra/runs/run-C8B1DPJYyWH7WP9F

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
cloudflare_record.MX_evsyukov_org_db0531023ecfb45d22a83b7386102b79: Refreshing state... [id=db0531023ecfb45d22a83b7386102b79]
cloudflare_record.TXT__keybase_denis_evsyukov_org_1e8df918107287c99356f9ecc2b35325: Refreshing state... [id=1e8df918107287c99356f9ecc2b35325]
cloudflare_record.CNAME_vim_juev_org_01a13418b51f46b840ea2e6e02d2b74c: Refreshing state... [id=01a13418b51f46b840ea2e6e02d2b74c]
cloudflare_record.CNAME_drive_evsyukov_org_9066572e98ab250c90eda2a6edab9061: Refreshing state... [id=9066572e98ab250c90eda2a6edab9061]
cloudflare_record.MX_evsyukov_org_40c2d8b6114676d384f72083b85cc98b: Refreshing state... [id=40c2d8b6114676d384f72083b85cc98b]
cloudflare_record.CNAME_f4b7dbd564dd6619bd7daa168f978baf_juev_org_f7d906a5ac19ab6639190d361d9e0c1e: Refreshing state... [id=f7d906a5ac19ab6639190d361d9e0c1e]
cloudflare_record.CNAME_groups_evsyukov_org_429ec789f04833d966f9cb57433796dc: Refreshing state... [id=429ec789f04833d966f9cb57433796dc]
cloudflare_record.CNAME_static_juev_org_96d36a26405cac95b363245170392c1b: Refreshing state... [id=96d36a26405cac95b363245170392c1b]
cloudflare_record.TXT_juev_org_1db51fdf444808f41299c0cd4d4473eb: Refreshing state... [id=1db51fdf444808f41299c0cd4d4473eb]
cloudflare_record.A_traefik_juev_org: Refreshing state... [id=73f14e2c84c61e03a46fc946ba8a3484]
cloudflare_record.CNAME_juev_org: Refreshing state... [id=1bd3699635e797fb601de749293f53c5]
cloudflare_record.CNAME_start_evsyukov_org_3ae2eb301edbca3f2a607b4d1fd4a9e0: Refreshing state... [id=3ae2eb301edbca3f2a607b4d1fd4a9e0]
cloudflare_record.MX_evsyukov_org_1786f6b103cf0e95871df734e99685ed: Refreshing state... [id=1786f6b103cf0e95871df734e99685ed]
cloudflare_record.CNAME_reader_juev_org_2465c6d05322d95243d4b7933c7f9db2: Refreshing state... [id=96860734106b06ce6f986972cdd91cea]
cloudflare_record.TXT_google__domainkey_evsyukov_org_b43036b3cc88380b85f32ec5f2a1d36b: Refreshing state... [id=b43036b3cc88380b85f32ec5f2a1d36b]
digitalocean_droplet.do_droplet: Refreshing state... [id=109169855]
cloudflare_page_rule.page_rule_bef60f7762aa332305e6556d686cd5db: Refreshing state... [id=bef60f7762aa332305e6556d686cd5db]
cloudflare_record.CNAME_calendar_evsyukov_org_9e46c0e47a075506d8872750acbb4b93: Refreshing state... [id=9e46c0e47a075506d8872750acbb4b93]
cloudflare_record.CNAME_status_juev_org_da4d38417e47ffc77936abb190084e85: Refreshing state... [id=da4d38417e47ffc77936abb190084e85]
cloudflare_record.AAAA_ssh_juev_org_9b41c230f3794402c9cea87f2c624338: Refreshing state... [id=9b41c230f3794402c9cea87f2c624338]
cloudflare_record.TXT_juev_org_3e4eeb1a6920fd5c3a80330b3189aa32: Refreshing state... [id=3e4eeb1a6920fd5c3a80330b3189aa32]
cloudflare_record.TXT_evsyukov_org_1c41d4d0443552b938d5506d19d80e09: Refreshing state... [id=1c41d4d0443552b938d5506d19d80e09]
cloudflare_record.CNAME_googleffffffffd590189c_evsyukov_org_d290579d90da07e6c1ef944f0337288c: Refreshing state... [id=d290579d90da07e6c1ef944f0337288c]
cloudflare_record.CNAME_mail_evsyukov_org_a431b903706f74c8a4e18c5813e9571d: Refreshing state... [id=a431b903706f74c8a4e18c5813e9571d]
cloudflare_record.A_ssh_juev_org_1089435074dda28e04bbe02851cfa9d0: Refreshing state... [id=1089435074dda28e04bbe02851cfa9d0]
cloudflare_record.AAAA_proxy_juev_org_4cffdae12d1dc2d8823e13e4946f0ff8: Refreshing state... [id=4cffdae12d1dc2d8823e13e4946f0ff8]
cloudflare_record.TXT__keybase_www_juev_org_57f3fa1cf8d46f862ed3c86e06c1a234: Refreshing state... [id=57f3fa1cf8d46f862ed3c86e06c1a234]
cloudflare_record.MX_evsyukov_org_fbc8f542cb9b33092e0acaf4d7995606: Refreshing state... [id=fbc8f542cb9b33092e0acaf4d7995606]
cloudflare_record.MX_evsyukov_org_1716946a24f8b8da15d6fabd53dbb618: Refreshing state... [id=1716946a24f8b8da15d6fabd53dbb618]
cloudflare_record.CNAME_sites_evsyukov_org_473ff56542aaeb9b6d259492798aa1ce: Refreshing state... [id=473ff56542aaeb9b6d259492798aa1ce]
cloudflare_page_rule.page_rule_5674f6b8d559dcc04f09f191592faa54: Refreshing state... [id=5674f6b8d559dcc04f09f191592faa54]
cloudflare_record.CNAME_www_juev_org_dc305d442731c76481cb6eca462dd172: Refreshing state... [id=dc305d442731c76481cb6eca462dd172]
cloudflare_record.TXT_evsyukov_org_38af72ff7b267f1cae4a19d1284c64e4: Refreshing state... [id=38af72ff7b267f1cae4a19d1284c64e4]
cloudflare_record.A_proxy_juev_org_5d923fba6db8145bbc75f68ed61b99c9: Refreshing state... [id=5d923fba6db8145bbc75f68ed61b99c9]
cloudflare_record.CNAME_docs_evsyukov_org_0e9193431da5f52e52b9731030f8a49e: Refreshing state... [id=0e9193431da5f52e52b9731030f8a49e]
cloudflare_record.CNAME_denis_evsyukov_org_6581e7b63947ee9c3e3e692e7dc0ed13: Refreshing state... [id=6581e7b63947ee9c3e3e692e7dc0ed13]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.A_m_juev_org will be created
  + resource "cloudflare_record" "A_m_juev_org" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "m"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 1
      + type        = "A"
      + value       = "100.102.136.108"
      + zone_id     = "d8e41b5a0763aa78894ee1a327d1d070"
    }

  # cloudflare_record.A_pi_juev_org will be created
  + resource "cloudflare_record" "A_pi_juev_org" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "pi"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 1
      + type        = "A"
      + value       = "100.102.136.108"
      + zone_id     = "d8e41b5a0763aa78894ee1a327d1d070"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @juev, Action: `pull_request`*